---
type: LinkConversionData
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# LinkConversionData

`Autodesk.Revit.DB.LinkConversionData` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetOptions | 2015 | `public IDictionary < string , string > GetOptions ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Path | 2015 | `public string Path { get ; }` |
| Property | ServerId | 2015 | `public Guid ServerId { get ; }` |